/*=====================================
	■■■ 자바의 개요 및 특징 ■■■
	-자바 소스코드 입력 및 컴파일 실습
	-실행 및 관찰
=====================================*/

public class Test002
{
	public static void main(String [] args)
	{
		System.out.println("안녕하세요");
		System.out.println("장현성입니다.");
		System.out.println("오늘은 6월 29일 입니다.");

		System.out.print("반갑습니다.");
		System.out.print("화이팅합시다.");

		//『println()』과 『print()』 메소드는
		// 같은 상자에서 꺼낸 유사한 도구이지만
		// 이 도구는 서로 다른 도구이며,
		// 두 메소드의 차이는
		// 라인 스킵(줄바꿈) 유무이다.

		// 컴파일 시 클래스 파일이 생성되고 클래스 파일에 주석은 제외되므로
		// 같은 코드의 파일은 결국 데이터 용량의 크기가 다. 
		// (주석을 입력하더라도 결국에는 데이터 용량의 차이에 영향을 주지않음) 

	}
}
