/*===========================================
	■■■ 자바 기본 프로그래밍 ■■■
	-비트 단위 연산자
============================================*/

public class Test022
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;
		System.out.printf("-a : %d%n", ~a);
		System.out.printf("-b : %d%n", ~b); // ~ : 비트 not


	}
}

// 실행 결괄
/*

-a : -11
-b : 9
계속하려면 아무 키나 누르십시오 . . .

*/

/*

a = 10 → 00001010

		    ↓ ~a
		 11111111
		  11110101   → -11 → chack? → ok~!!!
		 +00001011   →  11
		 ----------
		  00000000


b = -10 → ???????? → 11110110

		    ↓ ~b 
		  00001010   
		 +11110110   
		 ----------
		 



*/